Conditional Selection (Flitering) With and Without loc & iloc

In [7]:
import pandas as pd
data={'Name':['Priya','Aadhya','Krishna','Vedha','Priya','Mohan','Arjun'],
       'Marks':[98,89,99,87,90,83,82],
       'Grade':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(data,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks Grade
stu1    Priya     98    AA
stu2   Aadhya     89    AB
stu3  Krishna     99    AA
stu4    Vedha     87    AB
stu5    Priya     90    AC
stu6    Mohan     83    BA
stu7    Arjun     82    BB

1.STUDENTS HAVING MARKS>90

In [8]:
df[df['Marks']>90]

         Name  Marks Grade
stu1    Priya     98    AA
stu3  Krishna     99    AA

2.STUDENTS HAVING MARKS <90

In [10]:
df[df['Marks']<90]

        Name  Marks Grade
stu2  Aadhya     89    AB
stu4   Vedha     87    AB
stu6   Mohan     83    BA
stu7   Arjun     82    BB

3.STUDENTS HAVING "AB" GRADE

In [11]:
df[df['Grade']=='AB']

        Name  Marks Grade
stu2  Aadhya     89    AB
stu4   Vedha     87    AB

4.STUDENTS HAVING MARKS >80 AND HAVING 'AB' GRADE

In [12]:
df[(df['Marks']>80)&(df['Grade']=='AB')]

        Name  Marks Grade
stu2  Aadhya     89    AB
stu4   Vedha     87    AB

5.NAME OF THE STUDENT HAVING MARKS >90

In [13]:
df[df['Marks']>90] ['Name']

stu1      Priya
stu3    Krishna
Name: Name, dtype: object

6.NAME OF THE STUDENT HAVING 'AB' GRADE

In [14]:
df[df['Grade']=='AB']['Name']

stu2    Aadhya
stu4     Vedha
Name: Name, dtype: object

USING LOC :

1.STUDENTS HAVING MARKS>90

In [15]:
df.loc[df['Marks']>90]

         Name  Marks Grade
stu1    Priya     98    AA
stu3  Krishna     99    AA

2.STUDENTS HAVING MARKS GREATER THAN 80 AND HAVING 'AB' GRADE USING LOC

In [16]:
df.loc[(df['Marks']>80)&(df['Grade']=='AB')]

        Name  Marks Grade
stu2  Aadhya     89    AB
stu4   Vedha     87    AB

USING ILOC

1.STUDENTS HAVING MARKS>90

In [22]:
df[df.iloc[:,1]>90]

         Name  Marks Grade
stu1    Priya     98    AA
stu3  Krishna     99    AA

2.STUDENTS HAVING MARKS GREATER THAN 80 & HAVING 'AB' GRADE

In [25]:
df[(df.iloc[:,1]>90) & (df.iloc[:,2]=='AB')]
df

         Name  Marks Grade
stu1    Priya     98    AA
stu2   Aadhya     89    AB
stu3  Krishna     99    AA
stu4    Vedha     87    AB
stu5    Priya     90    AC
stu6    Mohan     83    BA
stu7    Arjun     82    BB

3.NAME OF THE STUDENT HAVING 'AB' GRADE

In [27]:
df[df.iloc[:,2]=='AB']['Name']

stu2    Aadhya
stu4     Vedha
Name: Name, dtype: object